<b><font size="6" color="red">ch12. 데이터프레임과 시리즈(Pandas)_1절-7절</font></b>

# 1절. 판다스 패키지
- 데이터분석을 위해 반드시 알아야 할 패키지. 넘파이를 기반으로 하며, 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임을 제공
- 결측치 처리, 크기변경(열삽입, 삭제), 데이터 정렬, 데이터 분할, 데이터 병합, 데이터프레임 생성, 부분 데이터셋 추출, <br>
  피벗과 언피벗, 레이블링, 파일입출력이 용이
* https://pypi.org/project/pandas/ (package index)
* https://pandas.pydata.org/pandas-docs/stable/reference/index.html (API reference)

In [2]:
# numpy 연습문제...
# 모듈, 패키지, 라이브러리, API

- 파이썬 표준 모듈은 아님. 아나콘다를 설치시 함께 설치가 이루어짐(pip install pandas / condas install pandas)

In [1]:
import pandas as pd
pd.__version__

'1.2.4'

In [2]:
data = pd.read_json('data/ch09_member1.json', encoding = 'cp949')
print(data)
print(type(data))

  name  age          email address
0  홍길동   20  hong@hong.com      서울
1  김김김   25   kim@hong.com      경기
<class 'pandas.core.frame.DataFrame'>

In [ ]:
data = pd.read_csv('data/ch09_member5.csv')
# 에러발생은 파일생성을 numpy장에서 제대로 안했기 때문...^^;

In [4]:
data = pd.read_csv('data/ch09_member1.csv', header=None)
data

        0   1                        2        3
0     Mia  23       "Mamma@google.com"  서울시 강북구
1  Dwayne  42   "johnson@7dollars.com"  서울시 마포구
2  Rachel  34     "notebook@apple.com"  서울시 금천구

In [5]:
data = pd.read_csv('data/ch09_member1.csv', header=None,
                       names=['name','age','email','address'])
data    # column names를 지정 #########################################
        # 아래 pd.DataFrame에서는 columns = [ , , ]로 설정함

     name  age                    email  address
0     Mia   23       "Mamma@google.com"  서울시 강북구
1  Dwayne   42   "johnson@7dollars.com"  서울시 마포구
2  Rachel   34     "notebook@apple.com"  서울시 금천구

In [6]:
iris = pd.read_hdf('data/ch09_iris2.hdf5', key='iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 2절. 데이터프레임 만들기

## 2.1 딕셔너리를 이용해서 데이터프레임 만들기

In [7]:
# value가 list인 딕셔너리를 데이터프레임으로
d = {'kor':[80,78], 'math':[87,94]}
df = pd.DataFrame(data=d) # shift + tab + tab을 통해 각 함수에 대한 설명 확인할 것.
df

   kor  math
0   80    87
1   78    94

In [8]:
# 딕셔너리 리스트를 데이터 프레임으로
d = [{'kor':100, 'math':95}, {'kor':90, 'math':99}]
df = pd.DataFrame(data=d)
df

   kor  math
0  100    95
1   90    99

In [9]:
d = [{'kor':100, 'math':95}, {'kor':90, 'math':99},{'math':88}]
df = pd.DataFrame(data=d)
df
# 모든 데이터의 key가 동일하지 않을 경우 : 입력값 누락, key값에의 오타 등이 발생 가능.
# 결측치가 들어갈 경우 해당 데이터 key값들이 float으로 변경됨.

     kor  math
0  100.0    95
1   90.0    99
2    NaN    88

In [14]:
d = [{'kor':86, 'mat': 95}, {'kor':77, 'mat':91},{'eng': 94}]
df = pd.DataFrame(data=d)
df

    kor   mat   eng
0  86.0  95.0   NaN
1  77.0  91.0   NaN
2   NaN   NaN  94.0

In [15]:
import numpy as np
type(np.nan)

float

## 2.2 리스트를 이용해 데이터프레임 만들기

In [16]:
# 방법1
kor = [100,90,95,78,65]
mat = [90,67,88,67,90]
df = pd.DataFrame({'kor':kor, 'math':math})
df

   kor  math
0  100    90
1   90    67
2   95    88
3   78    67
4   65    90

In [34]:
# 방법2
import numpy as np
np.c_[kor,math]
    # In particular, arrays will be stacked along their last axis 
        # after being upgraded to at least 2-D with 1’s post-pended to the shape (column vectors made out of 1-D arrays).

array([[100,  90],
       [ 90,  67],
       [ 95,  88],
       [ 78,  67],
       [ 65,  90]])

In [13]:
df = pd.DataFrame(np.c_[kor, math], columns=['kor','math'])
df                # columns명 설정하기! read_csv에서는 names=[ , , , ]였었음

   kor  math
0  100    90
1   90    67
2   95    88
3   78    67
4   65    90

## 2.3 read_csv()

In [17]:
df = pd.read_csv('data/ch12_상가정보따라하기.csv', encoding='utf-8', sep='|')
df.shape
# 화면에 모두 뿌리기 전에 .shpae로 데이터의 크기를 확인
# The sep Parameter 
# One of the optional parameters in read_csv() is sep, a shortened name for separator. 
    # This operator is the delimiter we talked about before. 
    # This sep parameter tells the interpreter, which delimiter is used in our dataset or in Layman’s term, 
    # how the data items are separated in our CSV file

(30, 8)

In [19]:
df = pd.read_csv('D:/bigdata/download/shareBigData/상가업소정보_201912_01.csv', encoding = 'utf-8', sep='|', nrows=30) # 30행만 가져올 것
df.shape

(573680, 39)

In [20]:
# head로 보기
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,19905471,와라와라호프,NaN,Q,음식,Q09,유흥주점,Q09A01,호프/맥주,I56219,...,1168010600106040000014378,대치상가,서울특별시 강남구 남부순환로 2933,135280,6280.0,NaN,1,NaN,127.061026,37.493922

In [21]:
df.head().T
df.head().transpose() # 행과 열을 교환

,0,1,2,3,4
상가업소번호,19905471,19911397,19911801,19912201,19932756
상호명,와라와라호프,커피빈코리아선릉로93길점,프로포즈,싱싱커피&토스트,가락사우나내스낵
지점명,NaN,코리아선릉로93길점,NaN,NaN,NaN
상권업종대분류코드,Q,Q,Q,Q,F
상권업종대분류명,음식,음식,음식,음식,생활서비스
상권업종중분류코드,Q09,Q12,Q09,Q07,F09
상권업종중분류명,유흥주점,커피점/카페,유흥주점,패스트푸드,대중목욕탕/휴게
상권업종소분류코드,Q09A01,Q12A01,Q09A01,Q07A10,F09A02
상권업종소분류명,호프/맥주,커피전문점/카페/다방,호프/맥주,토스트전문,사우나/증기탕/온천
표준산업분류코드,I56219,I56220,I56219,I56192,S96121
표준산업분류명,기타 주점업,비알콜 음료점업,기타 주점업,"피자, 햄버거, 샌드위치 및 유사 음식점업",욕탕업
시도코드,11,11,11,26,11
시도명,서울특별시,서울특별시,서울특별시,부산광역시,서울특별시
시군구코드,11680,11680,11545,26530,11710
시군구명,강남구,강남구,금천구,사상구,송파구
행정동코드,1168060000,1168064000,1154563000,2653062000,1171060000
행정동명,대치1동,역삼1동,독산3동,괘법동,석촌동
법정동코드,1168010600,1168010100,1154510200,2653010400,1171010500
법정동명,대치동,역삼동,독산동,괘법동,석촌동
지번코드,1168010600206040000,1168010100206960042,1154510200201620001,2653010400205780000,1171010500202560000
대지구분코드,1,1,1,1,1
대지구분명,대지,대지,대지,대지,대지
지번본번지,604,696,162,578,256
지번부번지,NaN,42.0,1.0,NaN,NaN
지번주소,서울특별시 강남구 대치동 604,서울특별시 강남구 역삼동 696-42,서울특별시 금천구 독산동 162-1,부산광역시 사상구 괘법동 578,서울특별시 송파구 석촌동 256
도로명코드,116802000003,116804166502,115453117003,265303139004,117103123001
도로명,서울특별시 강남구 남부순환로,서울특별시 강남구 선릉로93길,서울특별시 금천구 가산로,부산광역시 사상구 괘감로,서울특별시 송파구 가락로
건물본번지,2933,6,34,37,71
건물부번지,NaN,NaN,6.0,NaN,NaN
건물관리번호,1168010600106040000014378,1168010100106960042022041,1154510200101620001017748,2653010400105780000002037,1171010500102560005010490
건물명,대치상가,NaN,NaN,산업용품유통상가,NaN
도로명주소,서울특별시 강남구 남부순환로 2933,서울특별시 강남구 선릉로93길 6,서울특별시 금천구 가산로 34-6,부산광역시 사상구 괘감로 37,서울특별시 송파구 가락로 71
구우편번호,135280,135080,153010,617726,138846
신우편번호,6280.0,6149.0,8545.0,46977.0,5690.0
동정보,NaN,NaN,NaN,NaN,NaN
층정보,1,1,1,1,1
호정보,NaN,NaN,NaN,26,NaN
경도,127.061026,127.047883,126.89922,128.980455,127.104071
위도,37.493922,37.505675,37.471711,35.159774,37.500249

In [ ]:
'''
판다스 디스플레이 옵션
pd.options.display.max_columns = 숫자
pd.options.display.max_rows = 숫자
로 최대 표현가능 행/열 수에 대한 설정을 바꿀 수 있음
'''

In [87]:
# (1) CSV파일 불러오기
member_df = pd.read_csv('data/ch12_member(8.2).csv', encoding='UTF-8', sep=',')
member_df

  Name  Age             Email  Address
0  심권호   31  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  아이유   27     jieun@lee.com  부산시 강서구

In [88]:
# (2) 특정행 제외하기
member_df = pd.read_csv('data/ch12_member(8.2).csv', sep=',', skiprows=[1,3])
member_df

  Name  Age           Email  Address
0  김연아   32  Yuna@queen.com      세종시
1  아이유   27   jieun@lee.com  부산시 강서구

In [89]:
member_df = pd.read_csv('data/ch12_member(8.2).csv', sep=',', nrows=3)
member_df
# 처음 10000 행을 가져올 것 등의 명령
# 보다 보편적으로는 조건을 부여하여 원하는 데이터만 추출. eg) 주소가 서울인 경우...

  Name  Age             Email  Address
0  심권호   31  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구

In [90]:
# 3) 주석행 제거하고 가져오기
member_df = pd.read_csv('data/ch12_member(8.2).csv', sep=',', comment='#')
member_df

  Name  Age             Email  Address
0  심권호   31  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  아이유   27     jieun@lee.com  부산시 강서구

## 2.4 sklearn.datasets 모듈 데이터를 데이터프레임으로 변환

In [139]:
import numpy as np
import pandas as pd
from sklearn import datasets
# sklearn 패키지는 학습을 시키기 위한 많은 데이터셋들이 제공됨.
# sklearn 패키지에서 제공되는 데이터셋은 딕셔너리 형식으로 되어있음.
iris = datasets.load_iris()
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'C:\\Users\\tjoeun\\anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv'}

In [ ]:
iris.data
iris['data']

In [27]:
iris.feature_names
iris['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [62]:
# 
[col[:-5].strip().replace(' ','_') for col in iris.feature_names]

['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [ ]:
iris.target
iris['target']

In [63]:
iris['target_names']
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [64]:
# 종속변수
iris.target_names[iris.target]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [ ]:
# 독립변수
iris.data
# 종속변수
iris.target_names[iris.target]

In [29]:
print(iris.data.dtype) # float
print(iris.target_names[iris.target].dtype) # string

float64
<U10

In [28]:
print('독립변수의 차원 : ', iris.data.shape)
print('종속변수의 차원 : ', iris.target_names[iris.target].shape)

독립변수의 차원 :  (150, 4)
종속변수의 차원 :  (150,)

In [140]:
# 독립변수
data = iris.data
# 종속변수
target = iris.target_names[iris.target].reshape(150,1)

In [142]:
np.hstack( (data, target) ) # 행의 숫자가 일치해야함
    # numpy.hstack() function is used to stack the sequence of input arrays horizontally 
                                            # (i.e. column wise) to make a single array.
    # Tuple containing arrays to be stacked. 
                # The arrays must have the same shape along all but the second axis.

array([['5.1', '3.5', '1.4', '0.2', 'setosa'],
       ['4.9', '3.0', '1.4', '0.2', 'setosa'],
       ['4.7', '3.2', '1.3', '0.2', 'setosa'],
       ['4.6', '3.1', '1.5', '0.2', 'setosa'],
       ['5.0', '3.6', '1.4', '0.2', 'setosa'],
       ['5.4', '3.9', '1.7', '0.4', 'setosa'],
       ['4.6', '3.4', '1.4', '0.3', 'setosa'],
       ['5.0', '3.4', '1.5', '0.2', 'setosa'],
       ['4.4', '2.9', '1.4', '0.2', 'setosa'],
       ['4.9', '3.1', '1.5', '0.1', 'setosa'],
       ['5.4', '3.7', '1.5', '0.2', 'setosa'],
       ['4.8', '3.4', '1.6', '0.2', 'setosa'],
       ['4.8', '3.0', '1.4', '0.1', 'setosa'],
       ['4.3', '3.0', '1.1', '0.1', 'setosa'],
       ['5.8', '4.0', '1.2', '0.2', 'setosa'],
       ['5.7', '4.4', '1.5', '0.4', 'setosa'],
       ['5.4', '3.9', '1.3', '0.4', 'setosa'],
       ['5.1', '3.5', '1.4', '0.3', 'setosa'],
       ['5.7', '3.8', '1.7', '0.3', 'setosa'],
       ['5.1', '3.8', '1.5', '0.3', 'setosa'],
       ['5.4', '3.4', '1.7', '0.2', 'setosa'],
       ['5.1', '3.7', '1.5', '0.4', 'setosa'],
       ['4.6', '3.6', '1.0', '0.2', 'setosa'],
       ['5.1', '3.3', '1.7', '0.5', 'setosa'],
       ['4.8', '3.4', '1.9', '0.2', 'setosa'],
       ['5.0', '3.0', '1.6', '0.2', 'setosa'],
       ['5.0', '3.4', '1.6', '0.4', 'setosa'],
       ['5.2', '3.5', '1.5', '0.2', 'setosa'],
       ['5.2', '3.4', '1.4', '0.2', 'setosa'],
       ['4.7', '3.2', '1.6', '0.2', 'setosa'],
       ['4.8', '3.1', '1.6', '0.2', 'setosa'],
       ['5.4', '3.4', '1.5', '0.4', 'setosa'],
       ['5.2', '4.1', '1.5', '0.1', 'setosa'],
       ['5.5', '4.2', '1.4', '0.2', 'setosa'],
       ['4.9', '3.1', '1.5', '0.2', 'setosa'],
       ['5.0', '3.2', '1.2', '0.2', 'setosa'],
       ['5.5', '3.5', '1.3', '0.2', 'setosa'],
       ['4.9', '3.6', '1.4', '0.1', 'setosa'],
       ['4.4', '3.0', '1.3', '0.2', 'setosa'],
       ['5.1', '3.4', '1.5', '0.2', 'setosa'],
       ['5.0', '3.5', '1.3', '0.3', 'setosa'],
       ['4.5', '2.3', '1.3', '0.3', 'setosa'],
       ['4.4', '3.2', '1.3', '0.2', 'setosa'],
       ['5.0', '3.5', '1.6', '0.6', 'setosa'],
       ['5.1', '3.8', '1.9', '0.4', 'setosa'],
       ['4.8', '3.0', '1.4', '0.3', 'setosa'],
       ['5.1', '3.8', '1.6', '0.2', 'setosa'],
       ['4.6', '3.2', '1.4', '0.2', 'setosa'],
       ['5.3', '3.7', '1.5', '0.2', 'setosa'],
       ['5.0', '3.3', '1.4', '0.2', 'setosa'],
       ['7.0', '3.2', '4.7', '1.4', 'versicolor'],
       ['6.4', '3.2', '4.5', '1.5', 'versicolor'],
       ['6.9', '3.1', '4.9', '1.5', 'versicolor'],
       ['5.5', '2.3', '4.0', '1.3', 'versicolor'],
       ['6.5', '2.8', '4.6', '1.5', 'versicolor'],
       ['5.7', '2.8', '4.5', '1.3', 'versicolor'],
       ['6.3', '3.3', '4.7', '1.6', 'versicolor'],
       ['4.9', '2.4', '3.3', '1.0', 'versicolor'],
       ['6.6', '2.9', '4.6', '1.3', 'versicolor'],
       ['5.2', '2.7', '3.9', '1.4', 'versicolor'],
       ['5.0', '2.0', '3.5', '1.0', 'versicolor'],
       ['5.9', '3.0', '4.2', '1.5', 'versicolor'],
       ['6.0', '2.2', '4.0', '1.0', 'versicolor'],
       ['6.1', '2.9', '4.7', '1.4', 'versicolor'],
       ['5.6', '2.9', '3.6', '1.3', 'versicolor'],
       ['6.7', '3.1', '4.4', '1.4', 'versicolor'],
       ['5.6', '3.0', '4.5', '1.5', 'versicolor'],
       ['5.8', '2.7', '4.1', '1.0', 'versicolor'],
       ['6.2', '2.2', '4.5', '1.5', 'versicolor'],
       ['5.6', '2.5', '3.9', '1.1', 'versicolor'],
       ['5.9', '3.2', '4.8', '1.8', 'versicolor'],
       ['6.1', '2.8', '4.0', '1.3', 'versicolor'],
       ['6.3', '2.5', '4.9', '1.5', 'versicolor'],
       ['6.1', '2.8', '4.7', '1.2', 'versicolor'],
       ['6.4', '2.9', '4.3', '1.3', 'versicolor'],
       ['6.6', '3.0', '4.4', '1.4', 'versicolor'],
       ['6.8', '2.8', '4.8', '1.4', 'versicolor'],
       ['6.7', '3.0', '5.0', '1.7', 'versicolor'],
       ['6.0', '2.9', '4.5', '1.5', 'versicolor'],
       ['5.7', '2.6', '3.5', '1.0', 'versicolor'],
       ['5.5', '2.4', '3.8', '1.1', 'versicolor'],
       ['5.5', '2.4', '3.7', '1.0', 'versicolor'],
       ['5.8', '2.7', '3.9', '1.2', 'versicolor'],
       ['6.0', '2.7', '5.1', '1.6', 'versicolor'],
       ['5.4', '3.0', '4.5', '1.5', 'versicolor'],
       ['6.0', '3.4', '4.5', '1.6', 'versicolor'],
       ['6.7', '3.1', '4.7', '1.5', 'versicolor'],
       ['6.3', '2.3', '4.4', '1.3', 'versicolor'],
       ['5.6', '3.0', '4.1', '1.3', 'versicolor'],
       ['5.5', '2.5', '4.0', '1.3', 'versicolor'],
       ['5.5', '2.6', '4.4', '1.2', 'versicolor'],
       ['6.1', '3.0', '4.6', '1.4', 'versicolor'],
       ['5.8', '2.6', '4.0', '1.2', 'versicolor'],
       ['5.0', '2.3', '3.3', '1.0', 'versicolor'],
       ['5.6', '2.7', '4.2', '1.3', 'versicolor'],
       ['5.7', '3.0', '4.2', '1.2', 'versicolor'],
       ['5.7', '2.9', '4.2', '1.3', 'versicolor'],
       ['6.2', '2.9', '4.3', '1.3', 'versicolor'],
       ['5.1', '2.5', '3.0', '1.1', 'versicolor'],
       ['5.7', '2.8', '4.1', '1.3', 'versicolor'],
       ['6.3', '3.3', '6.0', '2.5', 'virginica'],
       ['5.8', '2.7', '5.1', '1.9', 'virginica'],
       ['7.1', '3.0', '5.9', '2.1', 'virginica'],
       ['6.3', '2.9', '5.6', '1.8', 'virginica'],
       ['6.5', '3.0', '5.8', '2.2', 'virginica'],
       ['7.6', '3.0', '6.6', '2.1', 'virginica'],
       ['4.9', '2.5', '4.5', '1.7', 'virginica'],
       ['7.3', '2.9', '6.3', '1.8', 'virginica'],
       ['6.7', '2.5', '5.8', '1.8', 'virginica'],
       ['7.2', '3.6', '6.1', '2.5', 'virginica'],
       ['6.5', '3.2', '5.1', '2.0', 'virginica'],
       ['6.4', '2.7', '5.3', '1.9', 'virginica'],
       ['6.8', '3.0', '5.5', '2.1', 'virginica'],
       ['5.7', '2.5', '5.0', '2.0', 'virginica'],
       ['5.8', '2.8', '5.1', '2.4', 'virginica'],
       ['6.4', '3.2', '5.3', '2.3', 'virginica'],
       ['6.5', '3.0', '5.5', '1.8', 'virginica'],
       ['7.7', '3.8', '6.7', '2.2', 'virginica'],
       ['7.7', '2.6', '6.9', '2.3', 'virginica'],
       ['6.0', '2.2', '5.0', '1.5', 'virginica'],
       ['6.9', '3.2', '5.7', '2.3', 'virginica'],
       ['5.6', '2.8', '4.9', '2.0', 'virginica'],
       ['7.7', '2.8', '6.7', '2.0', 'virginica'],
       ['6.3', '2.7', '4.9', '1.8', 'virginica'],
       ['6.7', '3.3', '5.7', '2.1', 'virginica'],
       ['7.2', '3.2', '6.0', '1.8', 'virginica'],
       ['6.2', '2.8', '4.8', '1.8', 'virginica'],
       ['6.1', '3.0', '4.9', '1.8', 'virginica'],
       ['6.4', '2.8', '5.6', '2.1', 'virginica'],
       ['7.2', '3.0', '5.8', '1.6', 'virginica'],
       ['7.4', '2.8', '6.1', '1.9', 'virginica'],
       ['7.9', '3.8', '6.4', '2.0', 'virginica'],
       ['6.4', '2.8', '5.6', '2.2', 'virginica'],
       ['6.3', '2.8', '5.1', '1.5', 'virginica'],
       ['6.1', '2.6', '5.6', '1.4', 'virginica'],
       ['7.7', '3.0', '6.1', '2.3', 'virginica'],
       ['6.3', '3.4', '5.6', '2.4', 'virginica'],
       ['6.4', '3.1', '5.5', '1.8', 'virginica'],
       ['6.0', '3.0', '4.8', '1.8', 'virginica'],
       ['6.9', '3.1', '5.4', '2.1', 'virginica'],
       ['6.7', '3.1', '5.6', '2.4', 'virginica'],
       ['6.9', '3.1', '5.1', '2.3', 'virginica'],
       ['5.8', '2.7', '5.1', '1.9', 'virginica'],
       ['6.8', '3.2', '5.9', '2.3', 'virginica'],
       ['6.7', '3.3', '5.7', '2.5', 'virginica'],
       ['6.7', '3.0', '5.2', '2.3', 'virginica'],
       ['6.3', '2.5', '5.0', '1.9', 'virginica'],
       ['6.5', '3.0', '5.2', '2.0', 'virginica'],
       ['6.2', '3.4', '5.4', '2.3', 'virginica'],
       ['5.9', '3.0', '5.1', '1.8', 'virginica']], dtype='<U32')

In [ ]:
# 처음부터 하나의 데이터프레임으로 가져올 수 있는데 
    # 연습하려고 두 개로 나눴다가 다시 합치는 거임???
        # -> 연습용 데이터의 구성이 {data, target, ..., ...}

In [37]:
# 독립변수, 종속변수 따로 데이터프레임으로 만들고 concat
x = pd.DataFrame(iris.data, columns=iris.feature_names) # type : list
x
    # 열이름 재구성하여 변경이 필요한 경우 위에서 했던 방법 참조!
    # 빈 칸이 있을 경우 제한되는 기능들이 있음.

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [36]:
y = pd.DataFrame(iris.target_names[iris.target], columns=['species'])
y

       species
0       setosa
1       setosa
2       setosa
3       setosa
4       setosa
..         ...
145  virginica
146  virginica
147  virginica
148  virginica
149  virginica

[150 rows x 1 columns]

In [ ]:
# 열병합 concat( ... , axis=1)

In [38]:
iris_df = pd.concat([x, y], axis=1) # 함수를 모를 땐 shift + tab + tab 기억!
iris_df
# 열병합의 하기 위해선 행의 수가 같아야 함.

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica
146,6.3,2.5,5.0,1.9,virginica
147,6.5,3.0,5.2,2.0,virginica
148,6.2,3.4,5.4,2.3,virginica
149,5.9,3.0,5.1,1.8,virginica

In [39]:
iris_df['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [40]:
iris_df["sepal length (cm)"] # 가능
# iris_df.sepal length (cm)  ######################### 열이름에 빈 칸이 있어 제한되는 기능
iris_df.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)', 'species'],
      dtype='object')

In [83]:
[col[:12].strip().replace(' ', '_') for col in iris_df.columns]

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [84]:
iris_df.columns = [col[:12].strip().replace(' ', '_') for col in iris_df.columns]
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 3절. 이름(열,행) 지정하기

## 3.1 열 이름 지정하기

In [91]:
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df

  Name  Age             Email  Address
0  심권호   31  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  아이유   27     jieun@lee.com  부산시 강서구

In [88]:
member_df.columns

Index(['Name', ' Age', 'Email', 'Address'], dtype='object')

In [89]:
member_df.columns = ['이름', '나이', '이메일', '주소']
member_df

    이름  나이                이메일        주소
0  심권호  31   Kownho@sim.co.kr   경기도 용인시
1  김연아  32     Yuna@queen.com       세종시
2  추신수  41   Shinsoo@choo.net    인천시 중구
3  아이유  27      jieun@lee.com   부산시 강서구

## 3.2 행이름 지정하기

In [90]:
member_df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# member_df.index = range(101, 105) 로 재지정 가능

In [91]:
member_df.index = ['동', '서', '남', '북']
member_df

    이름  나이                이메일        주소
동  심권호  31   Kownho@sim.co.kr   경기도 용인시
서  김연아  32     Yuna@queen.com       세종시
남  추신수  41   Shinsoo@choo.net    인천시 중구
북  아이유  27      jieun@lee.com   부산시 강서구

In [93]:
# name을 행이름으로
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df

  Name   Age              Email   Address
0  심권호    31   Kownho@sim.co.kr   경기도 용인시
1  김연아    32     Yuna@queen.com       세종시
2  추신수    41   Shinsoo@choo.net    인천시 중구
3  아이유    27      jieun@lee.com   부산시 강서구

In [100]:
member = member_df.set_index('Name')
member

       Age              Email   Address
Name
심권호     31   Kownho@sim.co.kr   경기도 용인시
김연아     32     Yuna@queen.com       세종시
추신수     41   Shinsoo@choo.net    인천시 중구
아이유     27      jieun@lee.com   부산시 강서구

In [112]:
# 행이름을 컬럼에 편입시키기(위의 반대작업)
member.reset_index() # 실행한 결과가 출력되는 함수는 member를 수정시키지 않음.
                    # 수정시키고 싶은 경우 변수에 할당시킬 것!!! : member = member.reset_index()
                    # inplace = True 추가시 member를 수정시킴, 값을 반환출력하진 않음.
                    # 모르는 함수 확인은 shifrt + tab + tab!
                        # -> inplace = True는 결과값을 반환해주지만 수정을 가하지는 않음! ★★★

  Name   Age              Email   Address
0  심권호    31   Kownho@sim.co.kr   경기도 용인시
1  김연아    32     Yuna@queen.com       세종시
2  추신수    41   Shinsoo@choo.net    인천시 중구
3  아이유    27      jieun@lee.com   부산시 강서구

In [113]:
member # 위에 inplace = True를 설정하지 않아 데이터에 수정이 이루어지진 않았다.

       Age              Email   Address
Name
심권호     31   Kownho@sim.co.kr   경기도 용인시
김연아     32     Yuna@queen.com       세종시
추신수     41   Shinsoo@choo.net    인천시 중구
아이유     27      jieun@lee.com   부산시 강서구

In [114]:
member.reset_index(inplace = True)

In [115]:
member # inplace = True에 의해 데이터 자체에 변화가 생김.

  Name   Age              Email   Address
0  심권호    31   Kownho@sim.co.kr   경기도 용인시
1  김연아    32     Yuna@queen.com       세종시
2  추신수    41   Shinsoo@choo.net    인천시 중구
3  아이유    27      jieun@lee.com   부산시 강서구

In [43]:
member_df.columns

Index(['Name', ' Age', 'Email', 'Address'], dtype='object')

In [111]:
member_df.loc[1, 'Name']

'김연아'

## 3.3 레벨이름 지정하기
- 컬럼의 이름을 두 가지로 지정(?)

In [119]:
# 행이름을 두 게층으로 구성하기
member_df.columns = [['기본정보','기본정보','추가정보','추가정보'], ['이름','나이','이메일','주소']]
member_df.columns.names = ['대분류', '소분류']
member_df

대분류 기본정보                   추가정보
소분류   이름  나이                이메일        주소
0    심권호  31   Kownho@sim.co.kr   경기도 용인시
1    김연아  32     Yuna@queen.com       세종시
2    추신수  41   Shinsoo@choo.net    인천시 중구
3    아이유  27      jieun@lee.com   부산시 강서구

In [120]:
# index를 두 계층으로 구성하기
member_df.index = [['좌우','좌우','상하','상하'],['동','서','남','북']]
member_df

대분류  기본정보                   추가정보
소분류    이름  나이                이메일        주소
좌우 동  심권호  31   Kownho@sim.co.kr   경기도 용인시
   서  김연아  32     Yuna@queen.com       세종시
상하 남  추신수  41   Shinsoo@choo.net    인천시 중구
   북  아이유  27      jieun@lee.com   부산시 강서구

In [121]:
# 두 계층으로 행이름, 인덱스를 구성하면 데이터에 접근하기가 어려워진다...
member_df.loc['좌우','기본정보']['나이']['동']

31

# 4절. 부분데이터 조회

In [2]:
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment = '#')
member_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구

In [5]:
member_df.Name
member_df['Name']

0    심권호
1    김연아
2    추신수
3    아이유
Name: Name, dtype: object

In [ ]:
member_df[0] # 행을 조회할 경우 에러
             # 아래 해결방법. (loc함수 : 위에서도 실행해본 적 있음)

## 4.2 loc를 이용한 조회

In [7]:
member_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구

In [13]:
# loc[]을 이용하면 열이름, 행이름으로 조회.
                    # 콜론(:)은 사이의 모든 행이나 열을 선택해줌
member_df.loc[0:2] # 2행 포함

  Name  Age             Email  Address
가  심권호   28  Kwonho@sim.co.kr  경기도 용인시
나  김연아   32    Yuna@queen.com      세종시
다  추신수   40  Shinsoo@choo.net   인천시 중구

In [3]:
member_df.loc[0:2, 'Name':'Email']

  Name  Age             Email
0  심권호   28  Kwonho@sim.co.kr
1  김연아   32    Yuna@queen.com
2  추신수   40  Shinsoo@choo.net

In [12]:
# 0행, 2행 + Name열, Email열
member_df.loc[[0,2],['Name','Email']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [20]:
member_df.index = ['동','서','남','북'] # 으로 변경하였다면
member_df.loc['동':'남'] # 으로 조회해야한다.

  Name   Age              Email   Address
동  심권호    31   Kownho@sim.co.kr   경기도 용인시
서  김연아    32     Yuna@queen.com       세종시
남  추신수    41   Shinsoo@choo.net    인천시 중구

In [21]:
member_df.loc['동':'남', 'Name':'Email']

  Name   Age              Email
동  심권호    31   Kownho@sim.co.kr
서  김연아    32     Yuna@queen.com
남  추신수    41   Shinsoo@choo.net

In [22]:
member_df.loc[['동','남'],['Name','Email']]

  Name              Email
동  심권호   Kownho@sim.co.kr
남  추신수   Shinsoo@choo.net

In [ ]:
member_df.loc[2,3] # 위치를 가지고 데이터에 접근하고 싶지만, 오류!

## 4.3 iloc를 이용한 조회

In [23]:
# iloc[],  []안에 행, 열을 입력
# iloc[from : to : by] 슬라이싱 from부터 to전까지 by씩 증가
print(member_df.iloc[2,2])
print(member_df.iloc[0:3, 1:3])

 Shinsoo@choo.net
    Age              Email
동    31   Kownho@sim.co.kr
서    32     Yuna@queen.com
남    41   Shinsoo@choo.net

In [33]:
# Slicing ranges
member_df.iloc[::2]
            # With DataFrame, slicing inside of [] slices the rows.
            # 0번째 0+2번째 index row
            # [::3]인 경우 0번째 0+3번째 index row임을 확인함

  Name   Age              Email   Address
동  심권호    31   Kownho@sim.co.kr   경기도 용인시
남  추신수    41   Shinsoo@choo.net    인천시 중구

In [148]:
member_df.iloc[::-1]

  Name   Age              Email   Address
3  아이유    27      jieun@lee.com   부산시 강서구
2  추신수    41   Shinsoo@choo.net    인천시 중구
1  김연아    32     Yuna@queen.com       세종시
0  심권호    31   Kownho@sim.co.kr   경기도 용인시

In [151]:
member_df.iloc[[0,2],[1,2,3]]

    Age              Email   Address
0    31   Kownho@sim.co.kr   경기도 용인시
2    41   Shinsoo@choo.net    인천시 중구

## 4.4 조건으로 조회하기 ※
- iris 데이터 가져오기 1 : sklearn (데이터프레임이 아닌 딕셔너리로 가져옴)
- iris 데이터 가져오기 2 : seaborn
- iris 데이터 가져오기 3 : R 데이터 가져오기

### iris 데이터 가져오기 1 : sklearn (데이터프레임이 아닌 딕셔너리로 가져옴)

### iris 데이터 가져오기 2 : seaborn

In [153]:
import seaborn as sns
iris_df = sns.load_dataset('iris')
iris_df.sample(1)

    sepal_length  sepal_width  petal_length  petal_width species
39           5.1          3.4           1.5          0.2  setosa

### iris 데이터 가져오기 3 : R 데이터 가져오기
- r이 설치되어있지 않아도 됨

In [44]:
import statsmodels.api as sm
iris = sm.datasets.get_rdataset('iris', package='datasets')

- get_rdataset(데이터셋명, 패키지명)함수로 R데이터를 가져올 수 있음
    datasets 패키지명은 생략가능
- get_rdataset()함수로 불러온 데이터는 다음 속성을 가짐
    data : 데이터를 담고 있는 데이터프레임
    __doc__ : 데이터에 대한 설명 문자열

In [ ]:
iris.__doc__

In [45]:
iris_df = iris.data
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [97]:
# 0~8행, Sepal.Length~Peatal.Length열
iris_df.loc[:8, 'Sepal.Length':'Petal.Length']
                    # 이 경우 iloc이 더 편함;;;
                    # 행을 슬라이싱하는 조건이 있는 경우 loc가 필요

   Sepal.Length  Sepal.Width  Petal.Length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5
4           5.0          3.6           1.4
5           5.4          3.9           1.7
6           4.6          3.4           1.4
7           5.0          3.4           1.5
8           4.4          2.9           1.4

In [50]:
# iloc을 사용하지 못하고 반드시 loc이 필요한 경우
# Species가 versicolor인 데이터
iris_df['Species'] == 'versicolor'

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: Species, Length: 150, dtype: bool

In [134]:
iris_df.loc[iris_df['Species'] == 'versicolor','Sepal.Length':'Petal.Width'].head() 
                # 행에 대한 조건이 없는 경우라면 loc가 적용안되도 됨.
                # 조건을 부여하는 행,열을 불러올 경우 iloc은 사용할 수 없음.

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
50           7.0          3.2           4.7          1.4
51           6.4          3.2           4.5          1.5
52           6.9          3.1           4.9          1.5
53           5.5          2.3           4.0          1.3
54           6.5          2.8           4.6          1.5

In [133]:
# Sepal.Length가 6.5이상인 데이터 모든 열
iris_df.loc[iris_df['Sepal.Length']>= 6.5, ['Sepal.Width','Petal.Width']].head()
                # 행에 조건이 적용되어 일부만 slicing된다면 loc가 필요.
                # 조건을 부여하는 행,열을 불러올 경우 iloc은 사용할 수 없음.

    Sepal.Width  Petal.Width
50          3.2          1.4
52          3.1          1.5
54          2.8          1.5
58          2.9          1.3
65          3.1          1.4

In [ ]:
# versicolor종 중에서 Sepal.Length가 6.5보다 큰 데이터의 모든 열 출력.
# 조건이 2개

In [172]:
iris_df.loc[(iris_df['Species']=='versicolor') & (iris_df['Sepal.Length']> 6.5)]
            # &연산자가 먼저 처리되지 않도록 양 쪽을 ()로 묶어주어야 함.

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor

In [76]:
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df

  Name   Age              Email   Address
0  심권호    31   Kownho@sim.co.kr   경기도 용인시
1  김연아    32     Yuna@queen.com       세종시
2  추신수    41   Shinsoo@choo.net    인천시 중구
3  아이유    27      jieun@lee.com   부산시 강서구

In [60]:
# 주소가 강서구를 포함한 데이터만 추출
member_df[member_df['Address'].str.contains('강서구')]
member_df.loc[member_df['Address'].str.contains('강서구')]
            # 초록색 글씨만 있길래 스스로 해봄.
            # 아래에 솔루션 있었음 ㄷㄷㄷ;;;

  Name   Age           Email   Address
3  아이유    27   jieun@lee.com   부산시 강서구

In [174]:
member_df.info() # 데이터 요약

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1    Age     4 non-null      int64
 2   Email    4 non-null      object
 3   Address  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [68]:
member_df.isna()
    # 결측치 확인
    # 60만행의 데이터인 경우 확인 불가...

    Name    Age  Email  Address
0  False  False  False    False
1  False  False  False    False
2  False  False  False    False
3  False  False  False    False

In [182]:
member_df.isna().sum() # 행을 sum => 열별 결측 갯수, axis가 생략된 형태임

0    0
1    0
2    0
3    0
dtype: int64

In [183]:
member_df.isnull().sum() # 열별 결측치 갯수

Name       0
 Age       0
Email      0
Address    0
dtype: int64

In [ ]:
msg = "서울시 강서구 화곡동"
msg.find('강동구')

In [ ]:
시리즈를 문자함수로 쓰기 위해서 :
        https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

In [84]:
member_df.Address.str.find("강서구") 
                # find함수는 string을 파라미터로 입력받아야함.
                # member_df는 series임.

0   -1
1   -1
2   -1
3    5
Name: Address, dtype: int64

In [74]:
# Address가 강서구를 포함한 데이터의 모든 열
member_df[member_df.Address.str.find('강서구') != -1]

  Name   Age           Email   Address
3  아이유    27   jieun@lee.com   부산시 강서구

In [92]:
# 강서구에 거주하는 사람의 이름과 나이를 출력
member_df.loc[member_df.Address.str.find('강서구') != -1, ['Name','Age']]

  Name  Age
3  아이유   27

In [94]:
member_df.Age = member_df.Age.astype('float64') # int타입을 float64로 변환
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Age      4 non-null      float64
 2   Email    4 non-null      object
 3   Address  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 256.0+ bytes

# 5절. 데이터 추가 및 삭제

## 5.1 데이터 프레임의 요소삭제

In [198]:
# 1) 단일행 삭제
member_df.drop(1) # axis=0이면 행에서 index명을 찾아 삭제했을 경우의 결과를 반환(실제로는 삭제하지 않음.)
                  # inplace = True를 추가시 member_df에서 삭제하고 결과를 반환하지 않음.

  Name   Age              Email   Address
0  심권호    31   Kownho@sim.co.kr   경기도 용인시
2  추신수    41   Shinsoo@choo.net    인천시 중구
3  아이유    27      jieun@lee.com   부산시 강서구

In [ ]:
member_df.drop('북') # 없는 행이름을 삭제한 결과를 요청할 경우 오류(오류가 아니어도 삭제되는 명령이 아님!)

In [200]:
member_df.drop('Address',axis=1) # Address 행을 삭제한 결과를 반환(실제로는 삭제하지 않음)
                                 # inplace = True를 추가시 실제로 삭제가 이루어짐

  Name   Age              Email
0  심권호    31   Kownho@sim.co.kr
1  김연아    32     Yuna@queen.com
2  추신수    41   Shinsoo@choo.net
3  아이유    27      jieun@lee.com

In [ ]:
member_df.drop('Address', axis=1, inplace=True) # <--- 실행시 실제로 Address열이 삭제됨
member_df = member_df.drop('Address', axis=1, inplace=True) # <--- 실행시 실제로 Address열이 삭제됨

In [100]:
member_df.drop(labels = ['Age','Email'],axis=1) # 여러 열이나 행을 삭제할 때

  Name  Address
0  심권호  경기도 용인시
1  김연아      세종시
2  추신수   인천시 중구

## 5.2 데이터프레임의 요소 추가

In [110]:
# 1) 리스트를 이용한 열 추가
import pandas as pd
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df['BirthYear'] = [2000, 2001, 2002, 2002]
member_df

  Name  Age             Email  Address  BirthYear
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시       2000
1  김연아   32    Yuna@queen.com      세종시       2001
2  추신수   40  Shinsoo@choo.net   인천시 중구       2002
3  차범근   44   Boomboom@cha.kr  서울시 마포구       2002

In [111]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       4 non-null      object
 1   Age        4 non-null      int64
 2   Email      4 non-null      object
 3   Address    4 non-null      object
 4   BirthYear  4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

In [112]:
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df['BirthYear'] = [2001, 2002, None, 2000] # 결측치를 입력할 경우 type이 float
member_df

  Name  Age             Email  Address  BirthYear
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시     2001.0
1  김연아   32    Yuna@queen.com      세종시     2002.0
2  추신수   40  Shinsoo@choo.net   인천시 중구        NaN
3  차범근   44   Boomboom@cha.kr  서울시 마포구     2000.0

In [101]:
import numpy as np
type(np.nan)

float

In [113]:
# 2) 시리즈를 이용한 열 추가
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df['BirthYear'] = pd.Series([2001, 2002, None, 2000])
# member_df['BirthYear'] = pd.Series([2001, 2002, 2000], index=[0,1,3])
member_df

  Name  Age             Email  Address  BirthYear
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시     2001.0
1  김연아   32    Yuna@queen.com      세종시     2002.0
2  추신수   40  Shinsoo@choo.net   인천시 중구        NaN
3  차범근   44   Boomboom@cha.kr  서울시 마포구     2000.0

In [114]:
# 3) 딕셔너리로 행 추가
member_df = pd.read_csv('data/ch12_member(8.2).csv', comment='#')
member_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구

In [115]:
new_member = {'Name':'박지성',
              'Age': 26,
              'Email':'Jisung@park.com',
              'Address':'서울시 서대문구'}
new_df = member_df.append(new_member, ignore_index= True)
new_df

  Name  Age             Email   Address
0  심권호   28  Kwonho@sim.co.kr   경기도 용인시
1  김연아   32    Yuna@queen.com       세종시
2  추신수   40  Shinsoo@choo.net    인천시 중구
3  차범근   44   Boomboom@cha.kr   서울시 마포구
4  박지성   26   Jisung@park.com  서울시 서대문구

In [25]:
del new_df

In [26]:
new_df

NameError: name 'new_df' is not defined

In [116]:
# 4) 시리즈를 이용한 데이터행 추가
new_series = pd.Series(['파이썬', 25, 'abc@abs.com','서울시 도봉구'], index=member_df.columns)
new_series

Name               파이썬
Age                 25
Email      abc@abs.com
Address        서울시 도봉구
dtype: object

In [117]:
new_df = member_df.append(new_series, ignore_index=True)
new_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구
4  파이썬   25       abc@abs.com  서울시 도봉구

In [118]:
# 데이터프레임을 이용한 행 추가
new = pd.DataFrame([{'Name':'이순신',
                    'Age':50,
                    'Email':'lee@sun.com',
                     'Address':'통영'}])
new = pd.DataFrame({'Name':['이순신'],
                   'Age':[50],
                   'Email':['lee@sun.com'],
                   'Address':['통영']})
new

  Name  Age        Email Address
0  이순신   50  lee@sun.com      통영

In [119]:
new_df = member_df.append(new) # append함수는 추가한 값만 리턴할 뿐 member_df를 바꾸지 않음
new_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구
0  이순신   50       lee@sun.com       통영

In [29]:
new_df.index = range(len(new_df)) # append 추가로 인해 인덱스 0이 두 행이여서 다시 index재조정
new_df

  Name   Age              Email   Address   Age
0  심권호  31.0   Kownho@sim.co.kr   경기도 용인시   NaN
1  김연아  32.0     Yuna@queen.com       세종시   NaN
2  추신수  41.0   Shinsoo@choo.net    인천시 중구   NaN
3  아이유  27.0      jieun@lee.com   부산시 강서구   NaN
4  박지성   NaN    Jisung@park.com  서울시 서대문구  26.0

# 6절 정렬(행이름, 열이름, 값에 의한 정렬)

In [120]:
member_df

  Name  Age             Email  Address
0  심권호   28  Kwonho@sim.co.kr  경기도 용인시
1  김연아   32    Yuna@queen.com      세종시
2  추신수   40  Shinsoo@choo.net   인천시 중구
3  차범근   44   Boomboom@cha.kr  서울시 마포구

In [122]:
member_df.index = ('동','서','남','북')
member_df

  Name  Age             Email  Address
동  심권호   28  Kwonho@sim.co.kr  경기도 용인시
서  김연아   32    Yuna@queen.com      세종시
남  추신수   40  Shinsoo@choo.net   인천시 중구
북  차범근   44   Boomboom@cha.kr  서울시 마포구

In [123]:
member_df.sort_index(axis=0)
member_df.sort_index(axis='rows', inplace=True)
member_df

  Name  Age             Email  Address
남  추신수   40  Shinsoo@choo.net   인천시 중구
동  심권호   28  Kwonho@sim.co.kr  경기도 용인시
북  차범근   44   Boomboom@cha.kr  서울시 마포구
서  김연아   32    Yuna@queen.com      세종시

## 6.2 열이름으로 정렬

In [124]:
member_df.sort_index(axis=1)
member_df.sort_index(axis='columns')

   Address  Age             Email Name
남   인천시 중구   40  Shinsoo@choo.net  추신수
동  경기도 용인시   28  Kwonho@sim.co.kr  심권호
북  서울시 마포구   44   Boomboom@cha.kr  차범근
서      세종시   32    Yuna@queen.com  김연아

## 6.3 값으로 정렬

In [125]:
member_df.sort_values(by=['Address','Email'],ascending = False) # 데이터를 바꾸려면 inplace=True ^^

  Name  Age             Email  Address
남  추신수   40  Shinsoo@choo.net   인천시 중구
서  김연아   32    Yuna@queen.com      세종시
북  차범근   44   Boomboom@cha.kr  서울시 마포구
동  심권호   28  Kwonho@sim.co.kr  경기도 용인시

In [129]:
member_df.index = range(0,4)
member_df

  Name  Age             Email  Address
0  추신수   40  Shinsoo@choo.net   인천시 중구
1  심권호   28  Kwonho@sim.co.kr  경기도 용인시
2  차범근   44   Boomboom@cha.kr  서울시 마포구
3  김연아   32    Yuna@queen.com      세종시

# 7절. 기초통계분석
- count : NA를 제외한 갯수
- min : 최소값
- max : 
- sum : 
- cumsum : 누적합
- cumprod : 누적곱
- mean : 
- median :
- std : 표준편차
- var : 분산
- quantile : 분위수(0사분위수, 1사분위수, 중위수, 3사분위수)
- corr : 상관관계

In [130]:
# import statsmodels.api as sm
from statsmodels.api import datasets
iris_df = datasets.get_rdataset('iris').data
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## 7.1 최소값, 최대값, ...

In [49]:
iris_df.mean(axis=0) # axis=0 기본값, axis='rows', 생략가능

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [50]:
iris_df.mean(axis=1) # mean 대신 다른 함수로 대체가능! #################

0      2.550
1      2.375
2      2.350
3      2.350
4      2.550
       ...
145    4.300
146    3.925
147    4.175
148    4.325
149    3.950
Length: 150, dtype: float64

In [51]:
iris_df.quantile(q=[0.0, 0.25, 0.5, 0.75, 1], interpolation = 'nearest') # 사분위수

      Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0.00           4.3          2.0           1.0          0.1
0.25           5.1          2.8           1.6          0.3
0.50           5.8          3.0           4.3          1.3
0.75           6.4          3.3           5.1          1.8
1.00           7.9          4.4           6.9          2.5

## 7.2 요약통계량

In [54]:
# 1) 기본 요약 통계량
# iris_df.info()와 함께 자주 쓰임
iris_df.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [55]:
iris_df.Species.describe() # 문자열에서의 요약 통계량

count            150
unique             3
top       versicolor
freq              50
Name: Species, dtype: object

In [56]:
iris_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [59]:
iris_df.columns = [col.replace('.','_') for col in iris_df.columns]
iris_df

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [60]:
# 2) include와 exclude
import pandas as pd
df = pd.DataFrame({'a':[1,2]*3,
                  'b':[True, False]*3,
                  'c':[2.0, 4]*3})
df

   a      b    c
0  1   True  2.0
1  2  False  4.0
2  1   True  2.0
3  2  False  4.0
4  1   True  2.0
5  2  False  4.0

In [61]:
df.describe() # 기본값은 숫자열만 기본요약통계를 출력해줌

              a         c
count  6.000000  6.000000
mean   1.500000  3.000000
std    0.547723  1.095445
min    1.000000  2.000000
25%    1.000000  2.000000
50%    1.500000  3.000000
75%    2.000000  4.000000
max    2.000000  4.000000

In [62]:
df.describe(include=['float64', 'bool'])

            b         c
count       6  6.000000
unique      2       NaN
top     False       NaN
freq        3       NaN
mean      NaN  3.000000
std       NaN  1.095445
min       NaN  2.000000
25%       NaN  2.000000
50%       NaN  3.000000
75%       NaN  4.000000
max       NaN  4.000000

In [64]:
df.describe(exclude=['float64'])

               a      b
count   6.000000      6
unique       NaN      2
top          NaN  False
freq         NaN      3
mean    1.500000    NaN
std     0.547723    NaN
min     1.000000    NaN
25%     1.000000    NaN
50%     1.500000    NaN
75%     2.000000    NaN
max     2.000000    NaN

## 7.3 공분산, 상관계수

In [131]:
iris_df.cov()

              Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Sepal.Length      0.685694    -0.042434      1.274315     0.516271
Sepal.Width      -0.042434     0.189979     -0.329656    -0.121639
Petal.Length      1.274315    -0.329656      3.116278     1.295609
Petal.Width       0.516271    -0.121639      1.295609     0.581006

In [65]:
# -1 < 상관계수 < 1
iris_df.corr()

              Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
Sepal_Length      1.000000    -0.117570      0.871754     0.817941
Sepal_Width      -0.117570     1.000000     -0.428440    -0.366126
Petal_Length      0.871754    -0.428440      1.000000     0.962865
Petal_Width       0.817941    -0.366126      0.962865     1.000000